IDEA Open Model
ConeBreakoutCheckType Enumeration
Compatible with IDEA StatiCa 20.1
 Types of cone breakout checks
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ConeBreakoutCheckType
Public Enumeration ConeBreakoutCheckType
Members
Member name | Value | Description
Both | 0 |  Both tension and shear cone breakout checks are prerformed
Tension | 1 |  Only tension cone breakout checks are prerformed
Shear | 2 |  Only shear cone breakout checks are prerformed
None | 3 |  None of cone breakout checks are prerformed
See Also
Reference
IdeaRS.OpenModel Namespace